
## Plan Result

[CI link](https://github.com/Sadan007/aws-ecs-terraform/actions/runs/10575386793)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 2 to change, 8 to destroy.</code></pre>

* Create
  * module.vpc.aws_eip.nat[1]
  * module.vpc.aws_nat_gateway.this[0]
  * module.vpc.aws_nat_gateway.this[1]
  * module.vpc.aws_route.private_nat_gateway[0]
  * module.vpc.aws_route.private_nat_gateway[1]
* Update
  * aws_ecs_service.ecs_service
  * aws_lb.alb
* Replace
  * module.vpc.aws_route_table_association.private[0]
  * module.vpc.aws_route_table_association.private[1]
  * module.vpc.aws_route_table_association.public[0]
  * module.vpc.aws_route_table_association.public[1]
  * module.vpc.aws_subnet.private[0]
  * module.vpc.aws_subnet.private[1]
  * module.vpc.aws_subnet.public[0]
  * module.vpc.aws_subnet.public[1]


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:222433988246:service/go-simple-server/go-simple-server"
        name                               = "go-simple-server"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ network_configuration {
          ~ subnets          = [
              - "subnet-0519d9e896ce6ff9e",
              - "subnet-0a77a9aeafd4ce7b5",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb.alb will be updated in-place
  ~ resource "aws_lb" "alb" {
        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:loadbalancer/app/go-simple-server-alb/7a93167c0eda198d"
        name                                                         = "go-simple-server-alb"
      ~ subnets                                                      = [
          - "subnet-0256c9f78d841a962",
          - "subnet-07f941e0d631c5fea",
        ] -> (known after apply)
        tags                                                         = {}
        # (25 unchanged attributes hidden)

      ~ subnet_mapping {
          + arn                                                          = (known after apply)
          + arn_suffix                                                   = (known after apply)
          + client_keep_alive                                            = (known after apply)
          + customer_owned_ipv4_pool                                     = (known after apply)
          + desync_mitigation_mode                                       = (known after apply)
          + dns_name                                                     = (known after apply)
          + dns_record_client_routing_policy                             = (known after apply)
          + drop_invalid_header_fields                                   = (known after apply)
          + enable_cross_zone_load_balancing                             = (known after apply)
          + enable_deletion_protection                                   = (known after apply)
          + enable_http2                                                 = (known after apply)
          + enable_tls_version_and_cipher_suite_headers                  = (known after apply)
          + enable_waf_fail_open                                         = (known after apply)
          + enable_xff_client_port                                       = (known after apply)
          + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
          + id                                                           = (known after apply)
          + idle_timeout                                                 = (known after apply)
          + internal                                                     = (known after apply)
          + ip_address_type                                              = (known after apply)
          + load_balancer_type                                           = (known after apply)
          + name                                                         = (known after apply)
          + name_prefix                                                  = (known after apply)
          + preserve_host_header                                         = (known after apply)
          + security_groups                                              = (known after apply)
          + subnets                                                      = (known after apply)
          + tags                                                         = (known after apply)
          + tags_all                                                     = (known after apply)
          + vpc_id                                                       = (known after apply)
          + xff_header_processing_mode                                   = (known after apply)
          + zone_id                                                      = (known after apply)
        } -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0cfffb2303a12bcda"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all                           = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all                           = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-09a156d7c908c06f1"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0c69dafcca234aefc"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-09b1a4fd5ad355edf" -> (known after apply)
      ~ subnet_id      = "subnet-0519d9e896ce6ff9e" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0cec87098270a1bf9" -> (known after apply)
      ~ subnet_id      = "subnet-0a77a9aeafd4ce7b5" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0c3a390204c045162" -> (known after apply)
      ~ subnet_id      = "subnet-0256c9f78d841a962" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0c6c83d88caadab26" -> (known after apply)
      ~ subnet_id      = "subnet-07f941e0d631c5fea" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-1:222433988246:subnet/subnet-0519d9e896ce6ff9e" -> (known after apply)
      ~ availability_zone_id                           = "apne1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.3.1.0/24" -> "10.4.1.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0519d9e896ce6ff9e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "222433988246" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet 1a"
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-1:222433988246:subnet/subnet-0a77a9aeafd4ce7b5" -> (known after apply)
      ~ availability_zone_id                           = "apne1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.3.2.0/24" -> "10.4.2.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0a77a9aeafd4ce7b5" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "222433988246" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet 1c"
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-1:222433988246:subnet/subnet-0256c9f78d841a962" -> (known after apply)
      ~ availability_zone_id                           = "apne1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.3.11.0/24" -> "10.4.11.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0256c9f78d841a962" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "222433988246" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet 1a"
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-1:222433988246:subnet/subnet-07f941e0d631c5fea" -> (known after apply)
      ~ availability_zone_id                           = "apne1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.3.12.0/24" -> "10.4.12.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-07f941e0d631c5fea" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "222433988246" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet 1c"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 13 to add, 2 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":23,"Program":"tfcmt","SHA1":"28c455d0d9cad9dcd33f15db259ad924b44ebbee","Vars":{},"WorkflowName":"Terraform"} -->